trikset/trik-studio/plugins/robots/interpreters/stm32KitInterpreterCommon/src/stm32AdditionalPreferences.cpp
/* Copyright 2007-2015 QReal Research Group
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License. */

#include "stm32KitInterpreterCommon/stm32AdditionalPreferences.h"
#include "ui_stm32AdditionalPreferences.h"

#include <qrkernel/settingsManager.h>
#include <plugins/robots/thirdparty/qextserialport/src/qextserialenumerator.h>

using namespace stm32;
using namespace qReal;

Stm32AdditionalPreferences::Stm32AdditionalPreferences(const QStringList &realRobotNames, QWidget *parent)
	: AdditionalPreferences(parent)
	, mUi(new Ui::Stm32AdditionalPreferences)
	, mRealRobotNames(realRobotNames)
{
	mUi->setupUi(this);
}

Stm32AdditionalPreferences::~Stm32AdditionalPreferences()
{
	delete mUi;
}

void Stm32AdditionalPreferences::save()
{
	SettingsManager::setValue("Stm32TcpServer", mUi->tcpServerLineEdit->text());
	emit settingsChanged();
}

void Stm32AdditionalPreferences::restoreSettings()
{
	mUi->tcpServerLineEdit->setText(SettingsManager::value("Stm32TcpServer").toString());
}

void Stm32AdditionalPreferences::onRobotModelChanged(kitBase::robotModel::RobotModelInterface * const robotModel)
{
	const bool isReal = !robotModel->name().contains("TwoD");
	mUi->tcpSettingsGroupBox->setVisible(isReal);
}
